[
  {
    "id": 1,
    "image": "q1s3.png",
    "question": "You feel your tummy telling you that you need to pee. What should you do?",
    "meaningQ": "(Con cảm thấy bụng báo rằng con cần đi tiểu. Con nên làm gì?)",
    "A": "Stay silent and pee in your underwear.",
    "B": "Say, “May I go to the potty, please?”",
    "C": "Run around and hold your tummy.",
    "meaningA": "(Im lặng và đi tiểu vào quần lót.)",
    "meaningB": "(Nói: “Con xin đi vệ sinh được không ạ?”)",
    "meaningC": "(Chạy loanh quanh và ôm bụng.)",
    "feedbackA": "Pee belongs in the potty, not in underwear.",
    "feedbackB": "Good job! Asking to go potty is the right choice.",
    "feedbackC": "Running around doesn’t help. Let’s ask for the potty.",
    "ansA": false,
    "ansB": true,
    "ansC": false,
    "gender": "male"
  },
  {
    "id": 2,
    "image": "q2s3.png",
    "question": "You are sitting on the potty. What should you do next?",
    "meaningQ": "(Con đang ngồi trên bồn cầu. Con nên làm gì tiếp theo?)",
    "A": "Pull your pants back up without going.",
    "B": "Sit and pee or poop in the potty.",
    "C": "Yell and play loudly in the bathroom.",
    "meaningA": "(Kéo quần lên mà không đi tiểu/đi ngoài.)",
    "meaningB": "(Ngồi và đi tiểu hoặc đi ngoài vào bồn cầu.)",
    "meaningC": "(La hét và chơi ồn ào trong nhà vệ sinh.)",
    "feedbackA": "Oops, you forgot to go potty first.",
    "feedbackB": "Well done! Pee and poop go in the potty.",
    "feedbackC": "Playing in the bathroom is not safe. Let’s focus on potty time.",
    "ansA": false,
    "ansB": true,
    "ansC": false,
    "gender": "female"
  },
  {
    "id": 3,
    "image": "q3s3.png",
    "question": "You finish going potty. What should you do after flushing the toilet?",
    "meaningQ": "(Con đi vệ sinh xong. Sau khi xả nước bồn cầu, con nên làm gì?)",
    "A": "Wash your hands with soap and water.",
    "B": "Run out of the bathroom without washing.",
    "C": "Wipe your hands on your pants.",
    "meaningA": "(Rửa tay bằng xà phòng và nước.)",
    "meaningB": "(Chạy ra khỏi nhà vệ sinh mà không rửa tay.)",
    "meaningC": "(Lau tay vào quần.)",
    "feedbackA": "Great choice! Clean hands keep you healthy.",
    "feedbackB": "Not washing can spread germs. Let’s wash next time.",
    "feedbackC": "Pants don’t make hands clean. Soap and water do!",
    "ansA": true,
    "ansB": false,
    "ansC": false,
    "gender": "male"
  }
]
